In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [4]:
a = pd.Series(["Sulaiman" , 'Ahmed' , 'Khailid'] , [1 , 2 , 3])
a

1    Sulaiman
2       Ahmed
3     Khailid
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [9]:
a.index = ([11 , 12 , 13])
a

11    Sulaiman
12       Ahmed
13     Khailid
dtype: object

## Q3: Retrieve First and second elements.

In [10]:
a[:2]

11    Sulaiman
12       Ahmed
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [17]:
a = a.append(pd.Series({10: 'Ahmed'}))

C:\Users\salos\AppData\Local\Temp\ipykernel_10928\964474073.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  a = a.append(pd.Series({10: 'Ahmed'}))

In [19]:
a.drop_duplicates()

11    Sulaiman
12       Ahmed
13     Khailid
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [37]:
 std = {'ID':[123] , 'Name': ['Ahmed'] , 'age' : [19]}
stdData = pd.DataFrame(std , columns=['ID' , "Name" , 'age'])
stdData

    ID   Name  age
0  123  Ahmed   19

## Q6: Read educ_figdp_1_Data.csv file

In [33]:
edu = pd.read_csv('educ_figdp_1_Data.csv')
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [35]:
edu.loc[90:95]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
90,2006,Belgium,Total public expenditure on education as % of ...,5.98,d
91,2007,Belgium,Total public expenditure on education as % of ...,6.00,d
92,2008,Belgium,Total public expenditure on education as % of ...,6.43,d
93,2009,Belgium,Total public expenditure on education as % of ...,6.57,d
94,2010,Belgium,Total public expenditure on education as % of ...,6.58,d
95,2011,Belgium,Total public expenditure on education as % of ...,6.55,d

In [36]:
edu[90:95]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
90,2006,Belgium,Total public expenditure on education as % of ...,5.98,d
91,2007,Belgium,Total public expenditure on education as % of ...,6.00,d
92,2008,Belgium,Total public expenditure on education as % of ...,6.43,d
93,2009,Belgium,Total public expenditure on education as % of ...,6.57,d
94,2010,Belgium,Total public expenditure on education as % of ...,6.58,d